Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/atdf/PIC32MZ2064DAR169.atdf
         <register caption="DDR PHY DLL Recalibrate Register" name="DDRPHYDLLR" offset="0x24" rw="RW" size="4">
            <bitfield mask="0x03FFFF00" name="RECALIBCNT" />
            <bitfield caption="Disable Recalibration bit" mask="0x04000000" name="DISRECALIB" values="DDRPHYDLLR__DISRECALIB" />
            <bitfield mask="0xF0000000" name="DLYSTVAL" />
         </register>
         <register caption="DDR Phy Trim Register" name="DDRPHYDLLCTRL" offset="0x28" rw="RW" size="4">
            <bitfield caption = "Trim Setting bits" mask="0x000000FF" name="DDRDLLTRIM" values="DDRPHYDLLCTRL__DDRDLLTRIM"/>
         </register>
         <register caption="DDR Analog DLL Bypass Register" name="DDRADLLBYP" offset="0x5C" rw="RW" size="4">
            <bitfield caption="Bypass Analog DLL bit" mask="0x01000000" name="ANLDLLBYP" values="DDRADLLBYP__ANLDLLBYP" />
         </register>
         <register caption="DDR Analog DLL Bypass Register" name="DDRSCLCFG2" offset="0x6C" rw="RW" size="4">

            <bitfield caption="DDR SCL Configuration Register 2" mask="0x00000003" name="SCLLANSEL" values="DDRSCLCFG2__SCLLANSEL" />

         </register>
         <register caption="DDR PHY SCL Address Register" name="DDRPHYSCLADR" offset="0x88" rw="RW" size="4">
            <bitfield caption="SCL Bank Address bits" mask="0xE0000000" name="SCLBANKADR" values="DDRPHYSCLADR__SCLBANKADR" />
            <bitfield caption="SCL Column Address bits" mask="0x1FFF0000" name="SCLCOLADR" values="DDRPHYSCLADR__SCLCOLADR" />
            <bitfield caption="SCL Row Address bits" mask="0x0000FFFF" name="SCLROWADR" values="DDRPHYSCLADR__SCLROWADR" />
         </register>
         <register caption="DDR Clock Delta Delay Register" name="DDRPHYCLKDLY" offset="0x40" rw="RW" size="4">
            <bitfield caption="DDR Clock Delay Delta bits" mask="0x00000007" name="CLKDLYDELTA" values="DDRPHYCLKDLY__CLKDLYDELTA" />
            <bitfield caption="Self Calibration Logic Lower Data Byte Status bit" mask="0x00000008" name="SCLLBPASS" values="DDRPHYCLKDLY__SCLLBPASS" />
            <bitfield caption="Self Calibration Logic Upper Data Byte Status bit" mask="0x00000010" name="SCLUBPASS" values="DDRPHYCLKDLY__SCLUBPASS" />
         </register>
      </register-group>
      <value-group caption="Self Calibration Logic Lower Data Byte Status bit" name="DDRSCLSTART__SCLLBPASS">
         <value caption="Self calibration logic for lower data byte passed" name="" value="0x1" />
         <value caption="Self calibration logic for lower data byte failed" name="" value="0x0" />
      </value-group>
      <value-group caption="Self Calibration Logic Upper Data Byte Status bit" name="DDRSCLSTART__SCLUBPASS">
         <value caption="Self calibration logic for upper data byte passed" name="" value="0x1" />
         <value caption="Self calibration logic for upper data byte failed" name="" value="0x0" />
      </value-group>
      <value-group caption="Self Calibration Logic Enable bit" name="DDRSCLSTART__SCLEN">
         <value caption="Enable dynamic self calibration logic" name="" value="0x1" />
         <value caption="Disable dynamic self calibration logic" name="" value="0x0" />
      </value-group>
      <value-group caption="Start Self Calibration Logic bit" name="DDRSCLSTART__SCLSTART">
         <value caption="Start self calibration" name="" value="0x1" />
         <value caption="Do not start self calibration" name="" value="0x0" />
      </value-group>
      <value-group caption="PHY Burst 8 bit" name="DDRSCLCFG0__BURST8">
         <value caption="DRAM is in burst 8 mode while running SCL test" name="" value="0x1" />
         <value caption="DRAM is in burst 4 mode while running SCL test" name="" value="0x0" />
      </value-group>
      <value-group caption="DDR2 bit" name="DDRSCLCFG0__DDR2">
         <value caption="DDR2 is connected" name="" value="0x1" />
         <value caption="DDR2 is not connected" name="" value="0x0" />
      </value-group>
      <value-group caption="On-Die Termination Chip Select Write bit" name="DDRSCLCFG0__ODTCSW">
         <value caption="ODT is turned on to the DRAM on CS0 during writes performed by the SCL" name="" value="0x1" />
         <value caption="ODT is turned off to the DRAM on CS0 during writes performed by the SCL." name="" value="0x0" />
      </value-group>
      <value-group caption="SCL Chip Select Enable bit" name="DDRSCLCFG1__SCLCSEN">
         <value caption="Run SCL on Chip Select 0" name="" value="0x1" />
         <value caption="Do not run SCL on Chip Select 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Double Reference Delay bit" name="DDRSCLCFG1__DBLREFDLY">
         <value caption="SCL operation delay doubled" name="" value="0x1" />
         <value caption="SCL operation delay not doubled" name="" value="0x0" />
      </value-group>
      <value-group caption="On-Die Termination Select bit" name="DDRPHYPADCON__ODTSEL">
         <value caption="150 ohm On-Die Termination" name="" value="0x1" />
         <value caption="75 ohm On-Die Termination" name="" value="0x0" />
      </value-group>
      <value-group caption="On-Die Termination Enable bit" name="DDRPHYPADCON__ODTEN">
         <value caption="ODT Enabled" name="" value="0x1" />
         <value caption="ODT Disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Pad Drive Strength Select bit" name="DDRPHYPADCON__DATDRVSEL">
         <value caption="Full Drive Strength" name="" value="0x1" />
         <value caption="60% Drive Strength" name="" value="0x0" />
      </value-group>
      <value-group caption="Address and Control Pads Drive Strength Select bit" name="DDRPHYPADCON__ADDCDRVSEL">
         <value caption="Full drive strength" name="" value="0x1" />
         <value caption="60% Drive Strength" name="" value="0x0" />
      </value-group>
      <value-group caption="On-Die Termination Pull-up Calibration bits" name="DDRPHYPADCON__ODTPUCAL">
         <value caption="Maximum ODT impedance" name="" value="0x3" />
         <value caption="Minimum ODT impedance" name="" value="0x0" />
      </value-group>
      <value-group caption="Extra Output Enable bit" name="DDRPHYPADCON__EOENCLKCYC">
         <value caption="Drive pad output enables for an extra clock cycle after a write burst" name="" value="0x1" />
         <value caption="Do not drive pad output enables for an extra clock cycle after a write burst" name="" value="0x0" />
      </value-group>
      <value-group caption="No External DLL bit" name="DDRPHYPADCON__NOEXTDLL">
         <value caption="Use internal digital DLL." name="" value="0x1" />
         <value caption="Use external DLL." name="" value="0x0" />
      </value-group>
      <value-group caption="Write Command Delay bit" name="DDRPHYPADCON__WRCMDDLY">
         <value caption="Write command delay" name="" value="0x1" />
         <value caption="No Write command delay" name="" value="0x0" />
      </value-group>
