Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/atdf/PIC32MZ2064DAR169.atdf
      <value-group caption="Transmit Busy bit" name="ETHSTAT__TXBUSY">
         <value caption="TX logic is receiving data" name="" value="0x1" />
         <value caption="TX logic is idle" name="" value="0x0" />
      </value-group>
      <value-group caption="Ethernet Module busy bit" name="ETHSTAT__ETHBUSY">
         <value caption="Ethernet logic has been turned on (ON (ETHCON1) = 1) or is completing a transaction" name="" value="0x80" />
         <value caption="Ethernet logic is idle" name="" value="0x0" />
      </value-group>
      <value-group caption="MAC Receive Enable bit" name="EMAC1CFG1__RXENABLE">
         <value caption="Enable the MAC receiving of frames" name="" value="0x1" />
         <value caption="Disable the MAC receiving of frames" name="" value="0x0" />
      </value-group>
      <value-group caption="MAC Pass all Receive Frames bit" name="EMAC1CFG1__PASSALL">
         <value caption="The MAC will accept all frames regardless of type (Normal vs. Control)" name="" value="0x1" />
         <value caption="The received Control frames are ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="MAC RX Flow Control bit" name="EMAC1CFG1__RXPAUSE">
         <value caption="The MAC acts upon received PAUSE Flow Control frames" name="" value="0x1" />
         <value caption="Received PAUSE Flow Control frames are ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="MAC TX Flow Control bit" name="EMAC1CFG1__TXPAUSE">
         <value caption="PAUSE Flow Control frames are allowed to be transmitted" name="" value="0x1" />
         <value caption="PAUSE Flow Control frames are blocked" name="" value="0x0" />
      </value-group>
      <value-group caption="MAC Loopback mode bit" name="EMAC1CFG1__LOOPBACK">
         <value caption="MAC Transmit interface is loop backed to the MAC Receive interface" name="" value="0x1" />
         <value caption="MAC normal operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Full-Duplex Operation bit" name="EMAC1CFG2__FULLDPLX">
         <value caption="The MAC operates in Full-Duplex mode" name="" value="0x1" />
         <value caption="The MAC operates in Half-Duplex mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Frame Length checking bit" name="EMAC1CFG2__LENGTHCK">
         <value caption="Both transmit and receive frame lengths are compared to the Length/Type field. If the Length/Type field represents a length then the check is performed. Mismatches are reported on the transmit/receive statistics vector." name="" value="0x1" />
         <value caption="Length/Type field check is not performed" name="" value="0x0" />
      </value-group>
      <value-group caption="Huge Frame enable bit" name="EMAC1CFG2__HUGEFRM">
         <value caption="Frames of any length are transmitted and received" name="" value="0x1" />
         <value caption="Huge frames are not allowed for receive or transmit" name="" value="0x0" />
      </value-group>
      <value-group caption="Delayed CRC bit" name="EMAC1CFG2__DELAYCRC">
         <value caption="Four bytes of header (ignored by the CRC function)" name="" value="0x1" />
         <value caption="No proprietary header" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC Enable1 bit" name="EMAC1CFG2__CRCENABLE">
         <value caption="The MAC will append a CRC to every frame whether padding was required or not. Must be set if the PADENABLE bit is set." name="" value="0x1" />
         <value caption="The frames presented to the MAC have a valid CRC" name="" value="0x0" />
      </value-group>
      <value-group caption="Pad/CRC Enable bit" name="EMAC1CFG2__PADENABLE">
         <value caption="The MAC will pad all short frames" name="" value="0x1" />
         <value caption="The frames presented to the MAC have a valid length" name="" value="0x0" />
      </value-group>
      <value-group caption="VLAN Pad Enable bit" name="EMAC1CFG2__VLANPAD">
         <value caption="The MAC will pad all short frames to 64 bytes and append a valid CRC" name="" value="0x1" />
         <value caption="The MAC does not perform padding of short frames" name="" value="0x0" />
      </value-group>
      <value-group caption="Automatic Detect Pad Enable bit" name="EMAC1CFG2__AUTOPAD">
         <value caption="The MAC will automatically detect the type of frame" name="" value="0x1" />
         <value caption="The MAC does not perform automatic detection" name="" value="0x0" />
      </value-group>
      <value-group caption="Pure Preamble Enforcement bit" name="EMAC1CFG2__PUREPRE">
         <value caption="The MAC will verify the content of the preamble to ensure it contains 0x55 and is error-free. A packet with errors in its preamble is discarded" name="" value="0x1" />
         <value caption="The MAC does not perform any preamble checking" name="" value="0x0" />
      </value-group>
      <value-group caption="Long Preamble Enforcement bit" name="EMAC1CFG2__LONGPRE">
         <value caption="The MAC only allows receive packets which contain preamble fields less than 12 bytes in length" name="" value="0x1" />
         <value caption="The MAC allows any length preamble as per the Standard" name="" value="0x0" />
      </value-group>
      <value-group caption="No Backoff bit" name="EMAC1CFG2__NOBKOFF">
         <value caption="Following a collision" name="" value="0x1" />
         <value caption="Following a collision" name="" value="0x0" />
      </value-group>
      <value-group caption="Backpressure/No Backoff bit" name="EMAC1CFG2__BPNOBKOFF">
         <value caption="The MAC after incidentally causing a collision during backpressure will immediately retransmit without backoff reducing the chance of further collisions and ensuring transmit packets get sent" name="" value="0x1" />
         <value caption="The MAC will not remove the backoff" name="" value="0x0" />
      </value-group>
      <value-group caption="Excess Defer bit" name="EMAC1CFG2__EXCESSDER">
         <value caption="The MAC will defer to carrier indefinitely as per the Standard" name="" value="0x1" />
         <value caption="The MAC will abort when the excessive deferral limit is reached" name="" value="0x0" />
      </value-group>
