Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/atdf/PIC32MZ2064DAR169.atdf
         <register caption="Real-Time Clock ALARM Control Register" name="RTCALRM" offset="0x10" rw="RW" size="4">
            <bitfield caption="Alarm Repeat Counter Value bits" mask="0x000000FF" name="ARPT" values="RTCALRM__ARPT" />
            <bitfield caption="Alarm Mask Configuration bits" mask="0x00000F00" name="AMASK" values="RTCALRM__AMASK" />
            <bitfield caption="Alarm Sync bit" mask="0x00001000" name="ALRMSYNC" values="RTCALRM__ALRMSYNC" />
            <bitfield caption="Alarm Pulse Initial Value bit" mask="0x00002000" name="PIV" values="RTCALRM__PIV" />
            <bitfield caption="Chime Enable bit" mask="0x00004000" name="CHIME" values="RTCALRM__CHIME" />
            <bitfield caption="Alarm Enable bit" mask="0x00008000" name="ALRMEN" values="RTCALRM__ALRMEN" />
         </register>
         <register caption="Real-Time Clock Time Value Register" name="RTCTIME" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x00000F00" name="SEC01" />
            <bitfield mask="0x0000F000" name="SEC10" />
            <bitfield mask="0x000F0000" name="MIN01" />
            <bitfield mask="0x00F00000" name="MIN10" />
            <bitfield mask="0x0F000000" name="HR01" />
            <bitfield mask="0xF0000000" name="HR10" />
         </register>
         <register caption="Real-Time Clock Date Value Register" name="RTCDATE" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="WDAY01" />
            <bitfield mask="0x00000F00" name="DAY01" />
            <bitfield mask="0x0000F000" name="DAY10" />
            <bitfield mask="0x000F0000" name="MONTH01" />
            <bitfield mask="0x00F00000" name="MONTH10" />
            <bitfield mask="0x0F000000" name="YEAR01" />
            <bitfield mask="0xF0000000" name="YEAR10" />
         </register>
         <register caption="Alarm Time Value Register" name="ALRMTIME" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000F00" name="SEC01" />
            <bitfield mask="0x0000F000" name="SEC10" />
            <bitfield mask="0x000F0000" name="MIN01" />
            <bitfield mask="0x00F00000" name="MIN10" />
            <bitfield mask="0x0F000000" name="HR01" />
            <bitfield mask="0xF0000000" name="HR10" />
         </register>
         <register caption="Alarm Date Value Register" name="ALRMDATE" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="WDAY01" />
            <bitfield mask="0x00000F00" name="DAY01" />
            <bitfield mask="0x0000F000" name="DAY10" />
            <bitfield mask="0x000F0000" name="MONTH01" />
            <bitfield mask="0x00F00000" name="MONTH10" />
         </register>
      </register-group>
      <value-group caption="RTCC Output Enable bit" name="RTCCON__RTCOE">
         <value caption="RTCC output is enabled" name="" value="0x1" />
         <value caption="RTCC output is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Half-Second Status bit" name="RTCCON__HALFSEC">
         <value caption="Second half period of a second" name="" value="0x1" />
         <value caption="First half period of a second" name="" value="0x0" />
      </value-group>
      <value-group caption="Real-Time Clock Value Registers Read Synchronization bit" name="RTCCON__RTCSYNC">
         <value caption="Real-time clock value registers can change while reading (due to a rollover ripple that results in an invalid data read). If the register is read twice and results in the same data" name="" value="0x1" />
         <value caption="Real-time clock value registers can be read without concern about a rollover ripple" name="" value="0x0" />
      </value-group>
      <value-group caption="Real-Time Clock Value Registers Write Enable bit" name="RTCCON__RTCWREN">
         <value caption="Real-Time Clock Value registers can be written to by the user" name="" value="0x1" />
         <value caption="Real-Time Clock Value registers are locked out from being written to by the user" name="" value="0x0" />
      </value-group>
      <value-group caption="RTCC Clock Enable Status bit" name="RTCCON__RTCCLKON">
         <value caption="RTCC Clock is actively running" name="" value="0x1" />
         <value caption="RTCC Clock is not running" name="" value="0x0" />
      </value-group>
      <value-group caption="RTCC Output Data Select bits" name="RTCCON__RTCOUTSEL">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="RTCC Clock is presented on the RTCC pin" name="" value="0x2" />
         <value caption="Seconds Clock is presented on the RTCC pin" name="" value="0x1" />
         <value caption="Alarm Pulse is presented on the RTCC pin when the alarm interrupt is triggered" name="" value="0x0" />
      </value-group>
      <value-group caption="RTCC Clock Select bits" name="RTCCON__RTCCLKSEL">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="RTCC uses the external 32.768 kHz Secondary Oscillator (SOSC)" name="" value="0x1" />
         <value caption="RTCC uses the internal 32 kHz oscillator (LPRC)" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="RTCCON__SIDL">
         <value caption="Disables RTCC operation when CPU enters Idle mode" name="" value="0x1" />
         <value caption="Continue normal operation when CPU enters Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="RTCC On bit" name="RTCCON__ON">
         <value caption="RTCC module is enabled" name="" value="0x1" />
         <value caption="RTCC module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Real-Time Clock Drift Calibration bits" name="RTCCON__CAL">
         <value caption="Maximum positive adjustment" name="" value="0x1ff" />
         <value caption="Minimum positive adjustment" name="" value="0x1" />
         <value caption="No adjustment" name="" value="0x0" />
         <value caption="Minimum negative adjustment" name="" value="0x3ff" />
         <value caption="Minimum negative adjustment" name="" value="0x200" />
      </value-group>
      <value-group caption="Alarm Repeat Counter Value bits" name="RTCALRM__ARPT">
         <value caption="Alarm will trigger 256 times" name="" value="0xff" />
         <value caption="Alarm will trigger 255 times" name="" value="0xfe" />
         <value caption="Alarm will trigger two times" name="" value="0x1" />
         <value caption="Alarm will trigger one time" name="" value="0x0" />
      </value-group>
      <value-group caption="Alarm Mask Configuration bits" name="RTCALRM__AMASK">
         <value caption="Every half-second" name="" value="0x0" />
         <value caption="Every second" name="" value="0x1" />
         <value caption="Every 10 seconds" name="" value="0x2" />
         <value caption="Every minute" name="" value="0x3" />
         <value caption="Every 10 minutes" name="" value="0x4" />
         <value caption="Every hour" name="" value="0x5" />
         <value caption="Once a day" name="" value="0x6" />
         <value caption="Once a week" name="" value="0x7" />
         <value caption="Once a month" name="" value="0x8" />
         <value caption="Once a year (except when configured for February 29" name="" value="0x9" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="11xx" />
      </value-group>
